java/src/latex_tutorial.org
#+TITLE:     Gradle的使用(chiplua)
#+AUTHOR:    刘涛
#+EMAIL:     liutao@haolianluo.com
#+DATE:      2014-07-08
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t f:t *:t <:t author:nil creator:nil timestamp:nil
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:info toc:t ltoc:t mouse:underline buttons:0 path:http://cs3.swfc.edu.cn/org-info-js/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_AUTHOR: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
# (setq org-export-html-use-infojs t)
#+OPTIONS: ^:nil  

- 针对java或者android项目gradle的讲解。
- 针对初级用户
  
* 概述
Gradle 是以 Groovy 语言为基础，面向Java应用为主。基于DSL（领域特定语言）语法的自动化构建工具。
** Gradle提供了什么
: 1.一种可切换的，像maven一样的基于约定的构建框架，却又从不锁住你（约定优于配置）
: Switchable, build-by-convention frameworks a la Maven. But we never lock you in!
: 2. 强大的支持多工程的构建
: 3. 强大的依赖管理（基于Apache Ivy），提供最大的便利去构建你的工程
: Language for dependency based programming
: 4. 全力支持已有的Maven或者Ivy仓库基础建设
: 5. 支持传递性依赖管理，在不需要远程仓库和pom.xml和ivy配置文件的前提下
: 6 基于groovy脚本构建，其build脚本使用groovy语言编写
: 7 具有广泛的领域模型支持你的构建A rich domain model for describing your build.

** 为什么使用gradle
   
: 1.Domain Specific Language (DSL) to describe and manipulate the build logic
: 2.Build files are Groovy based and allow mixing of declarative elements through the DSL and using code to manipulate the DSL elements to provide custom logic.
: 3.Built-in dependency management through Maven and/or Ivy.
: 4.Very flexible. Allows using best practices but doesn’t force its own way of doing things.
: 5.Plugins can expose their own DSL and their own API for build files to use.
: 6.Good Tooling API allowing IDE integration
** Gradle安装
    从官方网站www.gradle.org下载最新版本，解压后，将GRADLE_HOME/bin目录加到系统环境变量PATH上。测试是否配置成功在命令行运行：gradle -v 会打印出gradle的版本号等信息.

* Gradle详解
** 新建仓库
: 1. gradle init --type java-library ('basic', 'groovy-library', 'java-library', 'pom', 'scala-library'.)
: 2. (要使用Java插件)要支持生成jar包的jar工程，只要在build.gradle里面添加一行apply plugin: 'java'
** Java plugin --tasks
: gradle clean		     Deletes the project build directory.
: gradle cleanTaskName	     Deletes the output files produced by the specified task.
:			     For example cleanJar will delete the JAR file created by the jar task,
:			     and cleanTest will delete the test results created by the test task.
: gradle jar		     Assembles the JAR file. 在build/libs/目录下生成jar文件
: gradle compilejava	     Compiles production Java source files using javac.
: gradle processResources    Copies production resources into the production classes directory.
: gradle classes	     Assembles(装配，集合，收集) the production classes directory.
: gradle testClasses	     Assembles the test classes directory.
: gradle javadoc	     Generates API documentation for the production Java source, using Javadoc
: gradle test		     Runs the unit tests using JUnit or TestNG.
: gradle uploadArchives	     Uploads the artifacts in the archives configuration, including the JAR fi   
** Java plugin --source set tasks
: gradle compileSourceSetJava	     Compiles the given source set's Java source files using javac.
: gradle processSourceSetResources   Copies the given source set's resources into the classes directory.
: gradle sourceSetClasses	     Assembles the given source set's classes director
错误详解:
#+begin_src latex -n      
chiplua@chiplua:~/workspace/java/src$ gradle sourceSetClasses 
FAILURE: Build failed with an exception.
* What went wrong:
Task 'sourceSetClasses' not found in root project 'src'.

* Try:
Run gradle tasks to get a list of available tasks. Run with --stacktrace option to get the stack trace. Run with --info or --debug option to get more log output.

BUILD FAILED

Total time: 4.116 secs
chiplua@chiplua:~/workspace/java/src$ 
#+end_src
解决方法:

在build.gradle的sourceSets的main方法中添加:
:    sourceSetClasses {
:	sourceSet.output.classesDir = file("./build/sourceSetClassTest")
:    }
然后执行gradle  clean  gradle sourceSetClasses
可以看到:
#+begin_src latex -n      
chiplua@chiplua:~/workspace/java/src$ tree build
build
├── dependency-cache
└── sourceSetClassTest
    ├── Graph.class
    ├── Person.class
    ├── Product.class
    ├── ProductCreator.class
    ├── ProductFan.class
    ├── ProductMouse.class
    ├── Rectangular.class
    ├── Round.class
    ├── Square.class
    ├── Student.class
    ├── Test.class
    ├── Triangle.class
    └── Worker.class

2 directories, 13 files
chiplua@chiplua:~/workspace/java/src$ 
#+end_src
** Java plugin --lifecycle tasks
: gradle assemble	         Assembles all the archives in the project.
: gradle check		         Performs all verification tasks in the project.
: gradle buildNeeded	         Performs a full build of the project and all projects it depends on.
: gradle build		         Performs a full build of the project.
: gradle buildDependent          Performs a full build of the project and all projects which depend on it.
: gradle buildConfigurationName  Assembles the artifacts in the specified configuration.
:	    		         The task is added by the Base plugin which is implicitly applied by the Java plugin.
: gradle uploadConfigurationName Assembles and uploads the artifacts in the specified configuration. 
:				 The task is added by the Base plugin which is implicitly applied by the Java plugin.
