java/src/latex_tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="cn" xml:lang="cn">
<head>
<title>Gradle的使用(chiplua)</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Gradle的使用(chiplua)"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-07-08"/>
<meta name="author" content="刘涛"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Gradle的使用(chiplua)</h1>

<ul>
<li>针对java或者android项目gradle的讲解。
</li>
<li>针对初级用户
</li>
</ul>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 概述</a>
<ul>
<li><a href="#sec-1-1">1.1 Gradle提供了什么</a></li>
<li><a href="#sec-1-2">1.2 为什么使用gradle</a></li>
<li><a href="#sec-1-3">1.3 Gradle安装</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Gradle详解</a>
<ul>
<li><a href="#sec-2-1">2.1 新建仓库</a></li>
<li><a href="#sec-2-2">2.2 Java plugin &ndash;tasks</a></li>
<li><a href="#sec-2-3">2.3 Java plugin &ndash;source set tasks</a></li>
<li><a href="#sec-2-4">2.4 Java plugin &ndash;lifecycle tasks</a></li>
<li><a href="#sec-2-5">2.5 Java plugin &ndash;default project layout</a></li>
<li><a href="#sec-2-6">2.6 Dependency management依赖管理</a></li>
<li><a href="#sec-2-7">2.7 Convention properties传统属性</a></li>
<li><a href="#sec-2-8">2.8 Java plugin &ndash;other properties</a></li>
<li><a href="#sec-2-9">2.9 Working with source sets使用源集</a></li>
<li><a href="#sec-2-10">2.10 Source set properties源集属性</a></li>
<li><a href="#sec-2-11">2.11 Defining new source sets新建源集</a></li>
<li><a href="#sec-2-12">2.12 javadoc</a></li>
<li><a href="#sec-2-13">2.13 clean</a></li>
<li><a href="#sec-2-14">2.14 CompileJava编译</a></li>
<li><a href="#sec-2-15">2.15 Jar打包</a></li>
<li><a href="#sec-2-16">2.16 Manifest主配置清单</a></li>
<li><a href="#sec-2-17">2.17 Dependencies</a></li>
<li><a href="#sec-2-18">2.18 source files Dir</a></li>
<li><a href="#sec-2-19">2.19 在task中使用shell脚本</a></li>
</ul>
</li>
<li><a href="#sec-3">3 android项目中使用Gradle</a>
<ul>
<li><a href="#sec-3-1">3.1 构建一个Gradle android项目</a></li>
<li><a href="#sec-3-2">3.2 Gralde 打包参数详解</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1 打签名包</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3 打多渠道包(Product Flavor)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">

<p>Gradle 是以 Groovy 语言为基础，面向Java应用为主。基于DSL（领域特定语言）语法的自动化构建工具。
</p>
</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Gradle提供了什么</h3>
<div class="outline-text-3" id="text-1-1">

<pre class="example">
1.一种可切换的，像maven一样的基于约定的构建框架，却又从不锁住你（约定优于配置）
Switchable, build-by-convention frameworks a la Maven. But we never lock you in!
2. 强大的支持多工程的构建
3. 强大的依赖管理（基于Apache Ivy），提供最大的便利去构建你的工程
Language for dependency based programming
4. 全力支持已有的Maven或者Ivy仓库基础建设
5. 支持传递性依赖管理，在不需要远程仓库和pom.xml和ivy配置文件的前提下
6 基于groovy脚本构建，其build脚本使用groovy语言编写
7 具有广泛的领域模型支持你的构建A rich domain model for describing your build.
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 为什么使用gradle</h3>
<div class="outline-text-3" id="text-1-2">


<pre class="example">
1.Domain Specific Language (DSL) to describe and manipulate the build logic
2.Build files are Groovy based and allow mixing of declarative elements through the DSL and using code to manipulate the DSL elements to provide custom logic.
3.Built-in dependency management through Maven and/or Ivy.
4.Very flexible. Allows using best practices but doesn’t force its own way of doing things.
5.Plugins can expose their own DSL and their own API for build files to use.
6.Good Tooling API allowing IDE integration
</pre>

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Gradle安装</h3>
<div class="outline-text-3" id="text-1-3">

<p>    从官方网站www.gradle.org下载最新版本，解压后，将GRADLE_HOME/bin目录加到系统环境变量PATH上。测试是否配置成功在命令行运行：gradle -v 会打印出gradle的版本号等信息.
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Gradle详解</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 新建仓库</h3>
<div class="outline-text-3" id="text-2-1">

<pre class="example">
1. gradle init --type java-library ('basic', 'groovy-library', 'java-library', 'pom', 'scala-library'.)
2. (要使用Java插件)要支持生成jar包的jar工程，只要在build.gradle里面添加一行apply plugin: 'java'
</pre>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Java plugin &ndash;tasks</h3>
<div class="outline-text-3" id="text-2-2">

<pre class="example">
gradle clean               Deletes the project build directory.
gradle cleanTaskName       Deletes the output files produced by the specified task.
                           For example cleanJar will delete the JAR file created by the jar task,
                           and cleanTest will delete the test results created by the test task.
gradle jar                 Assembles the JAR file. 在build/libs/目录下生成jar文件
gradle compilejava         Compiles production Java source files using javac.
gradle processResources    Copies production resources into the production classes directory.
gradle classes             Assembles(装配，集合，收集) the production classes directory.
gradle testClasses         Assembles the test classes directory.
gradle javadoc             Generates API documentation for the production Java source, using Javadoc
gradle test                Runs the unit tests using JUnit or TestNG.
gradle uploadArchives      Uploads the artifacts in the archives configuration, including the JAR fi   
</pre>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Java plugin &ndash;source set tasks</h3>
<div class="outline-text-3" id="text-2-3">

<pre class="example">
gradle compileSourceSetJava        Compiles the given source set's Java source files using javac.
gradle processSourceSetResources   Copies the given source set's resources into the classes directory.
gradle sourceSetClasses            Assembles the given source set's classes director
</pre>

<p>错误详解:
</p>


<pre class="example"><span class="linenr"> 1:  </span>chiplua@chiplua:~/workspace/java/src$ gradle sourceSetClasses 
<span class="linenr"> 2:  </span>FAILURE: Build failed with an exception.
<span class="linenr"> 3:  </span>* What went wrong:
<span class="linenr"> 4:  </span>Task 'sourceSetClasses' not found in root project 'src'.
<span class="linenr"> 5:  </span>
<span class="linenr"> 6:  </span>* Try:
<span class="linenr"> 7:  </span>Run gradle tasks to get a list of available tasks. Run with --stacktrace option to get the stack trace. Run with --info or --debug option to get more log output.
<span class="linenr"> 8:  </span>
<span class="linenr"> 9:  </span>BUILD FAILED
<span class="linenr">10:  </span>
<span class="linenr">11:  </span>Total time: 4.116 secs
<span class="linenr">12:  </span>chiplua@chiplua:~/workspace/java/src$ 
</pre>

<p>
解决方法:
</p>
<p>
在build.gradle的sourceSets的main方法中添加:
</p><pre class="example">
   sourceSetClasses {
      sourceSet.output.classesDir = file("./build/sourceSetClassTest")
   }
</pre>

<p>然后执行gradle  clean  gradle sourceSetClasses
可以看到:
</p>


<pre class="example"><span class="linenr"> 1:  </span>chiplua@chiplua:~/workspace/java/src$ tree build
<span class="linenr"> 2:  </span>build
<span class="linenr"> 3:  </span>├── dependency-cache
<span class="linenr"> 4:  </span>└── sourceSetClassTest
<span class="linenr"> 5:  </span>    ├── Graph.class
<span class="linenr"> 6:  </span>    ├── Person.class
<span class="linenr"> 7:  </span>    ├── Product.class
<span class="linenr"> 8:  </span>    ├── ProductCreator.class
<span class="linenr"> 9:  </span>    ├── ProductFan.class
<span class="linenr">10:  </span>    ├── ProductMouse.class
<span class="linenr">11:  </span>    ├── Rectangular.class
<span class="linenr">12:  </span>    ├── Round.class
<span class="linenr">13:  </span>    ├── Square.class
<span class="linenr">14:  </span>    ├── Student.class
<span class="linenr">15:  </span>    ├── Test.class
<span class="linenr">16:  </span>    ├── Triangle.class
<span class="linenr">17:  </span>    └── Worker.class
<span class="linenr">18:  </span>
<span class="linenr">19:  </span>2 directories, 13 files
<span class="linenr">20:  </span>chiplua@chiplua:~/workspace/java/src$ 
</pre>

</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Java plugin &ndash;lifecycle tasks</h3>
<div class="outline-text-3" id="text-2-4">

<pre class="example">
gradle assemble                Assembles all the archives in the project.
gradle check                   Performs all verification tasks in the project.
gradle buildNeeded             Performs a full build of the project and all projects it depends on.
gradle build                   Performs a full build of the project.
gradle buildDependent          Performs a full build of the project and all projects which depend on it.
gradle buildConfigurationName  Assembles the artifacts in the specified configuration.
                               The task is added by the Base plugin which is implicitly applied by the Java plugin.
gradle uploadConfigurationName Assembles and uploads the artifacts in the specified configuration. 
                               The task is added by the Base plugin which is implicitly applied by the Java plugin.
</pre>

</div>

</div>
