java/src/latex_tutorial.org
** Java plugin --default project layout
:    src/main/java		     Production Java source
:    src/main/resources		     Production resources
:    src/test/java	             Test Java source
:    src/test/resources	             Test resources
:    src/sourceSet/java		     Java source for the given source set
:    src/sourceSet/resources	     Resources for the given source set

Changing the project layout改变工程布局
可以通过配置合适的源集来配置布局。下面是一个简单的例子修改了main中的 Java 和resource source 目录.
#+begin_src latex -n
Example Custom Java source layout
build.gradle
sourceSets {
    main {
        java {
            srcDir 'src/java'
        }
        resources {
            srcDir 'src/resources'
        }
    }
}    
#+end_src   
** Dependency management依赖管理
   Java插件有很多依赖配置，它把这些配置分给各个任务，如compileJava 和 test.
#+begin_src latex -n
Example Java plugin - dependency configurations
Name		Extends			Used by tasks	        Meaning
compile		-			compileJava		Compile time dependencies
runtime		compile			-			Runtime dependencies
testCompile	compile			compileTestJava	        Additional dependencies for compiling tests.
testRuntime	runtime, testCompile	test		        Additional dependencies for running tests only.
archives	-			uploadArchives	        Artifacts (e.g. jars) produced by this project.
default		runtime			-		        The default configuration used by a project dependency on this project.
							        Contains the artifacts and dependencies required by this project at runtime.
#+end_src   								
   对于加入工程的每个源集，Java插件增加如下依赖配置：
#+begin_src latex -n
Example: Java plugin - source set dependency configurations
Name			Extends			Used by tasks	        Meaning
sourceSetCompile	-			compileSourceSetJava	Compile time dependencies for the given source set
sourceSetRuntime	sourceSetCompile	-	                Runtime time dependencies for the given source set
#+end_src
** Convention properties传统属性
  Java插件有一些传统属性，如下。你可以直接在脚本中使用这些属性，
#+begin_src latex -n
Table: Java plugin - directory properties
Property name	    Type		Default value	             Description
reportsDirName	    String		reports		             The name of the directory to generate reports into, relative to the build directory.
reportsDir	    File (read-only)	buildDir/reportsDirName	     The directory to generate reports into.
testResultsDirName  String		test-results	             The name of the directory to generate test result .xml files into,
							             relative to the build directory.
testResultsDir	    File (read-only)	buildDir/testResultsDirName  The directory to generate test result .xml files into.
testReportDirName   String		tests		             The name of the directory to generate the test report into,
							             relative to the reports directory.
testReportDir	    File (read-only)	reportsDir/testReportDirName The directory to generate the test report into.
libsDirName	    String		libs		             The name of the directory to generate libraries into, relative to the build directory.
libsDir		    File (read-only)	buildDir/libsDirName	     The directory to generate libraries into.
distsDirName	    String		distributions	             The name of the directory to generate distributions into,
							             relative to the build directory.
distsDir	    File (read-only)	buildDir/distsDirName	     The directory to generate distributions into.
docsDirName	    String		docs		             The name of the directory to generate documentation into,
							             relative to the build directory.
docsDir		    File (read-only)	buildDir/docsDirName	     The directory to generate documentation into.
dependencyCacheDirName	String		dependency-cache	     The name of the directory to use to cache source dependency information,
							             relative to the build directory.
dependencyCacheDir  File (read-only)	buildDir/dependencyCacheDirName	 The directory to use to cache source dependency information.
#+end_src
  
** Java plugin --other properties
#+begin_src latex -n   
Property name		Type				Default value	                Description
sourceSets		SourceSetContainer(read-only)	Not null	                Contains the project's source sets.
sourceCompatibility	JavaVersion.			Value of the current used JVM	Java version compatibility to use when compiling Java source.
targetCompatibility	JavaVersion.			sourceCompatibility	        Java version to generate classes for.
archivesBaseName	String				projectName	                The basename to use for archives, such as JAR or ZIP files.
manifest		Manifest			an empty manifest	        The manifest to include in all JAR files.
#+end_src
这些属性来自传统对象：JavaPluginConvention, BasePluginConvention 和 ReportingBasePluginConvention.
** Working with source sets使用源集
  通过sourceSets 属性访问源集，它是工程盛放源集的容器， SourceSetContainer类型的。 还有一个基本块 sourceSets { } ，可以使用闭包来配置源集容器。源集容器工作方式和其他容器完全一样，比如任务tasks.
#+begin_src latex -n   
Example: Accessing a source set
build.gradle
// Various ways to access the main source set
println sourceSets.main.output.classesDir
println sourceSets['main'].output.classesDir
sourceSets {
    println main.output.classesDir
}
sourceSets {
    main {
        println output.classesDir
    }
}

// Iterate over the source sets
sourceSets.all {
    println name
}
#+end_src
要配置容器，只要用上面的任意一个方法设置源集属性值即可。源集的属性下面会描述。先简单看个例子：
#+begin_src latex -n   
Example:  Configuring the source directories of a source set
build.gradle
sourceSets {
    main {
        java {
            srcDir 'src/java'
        }
        resources {
            srcDir 'src/resources'
        }
    }
}
#+end_src
