java/src/latex_tutorial.html

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Java plugin &ndash;default project layout</h3>
<div class="outline-text-3" id="text-2-5">

<pre class="example">
   src/main/java                   Production Java source
   src/main/resources              Production resources
   src/test/java                   Test Java source
   src/test/resources              Test resources
   src/sourceSet/java              Java source for the given source set
   src/sourceSet/resources         Resources for the given source set
</pre>


<p>
Changing the project layout改变工程布局
可以通过配置合适的源集来配置布局。下面是一个简单的例子修改了main中的 Java 和resource source 目录.
</p>


<pre class="example"><span class="linenr"> 1:  </span>Example Custom Java source layout
<span class="linenr"> 2:  </span>build.gradle
<span class="linenr"> 3:  </span>sourceSets {
<span class="linenr"> 4:  </span>    main {
<span class="linenr"> 5:  </span>        java {
<span class="linenr"> 6:  </span>            srcDir 'src/java'
<span class="linenr"> 7:  </span>        }
<span class="linenr"> 8:  </span>        resources {
<span class="linenr"> 9:  </span>            srcDir 'src/resources'
<span class="linenr">10:  </span>        }
<span class="linenr">11:  </span>    }
<span class="linenr">12:  </span>}    
</pre>

</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Dependency management依赖管理</h3>
<div class="outline-text-3" id="text-2-6">

<p>   Java插件有很多依赖配置，它把这些配置分给各个任务，如compileJava 和 test.
</p>


<pre class="example"><span class="linenr">1:  </span>Example Java plugin - dependency configurations
<span class="linenr">2:  </span>Name            Extends                 Used by tasks           Meaning
<span class="linenr">3:  </span>compile         -                       compileJava             Compile time dependencies
<span class="linenr">4:  </span>runtime         compile                 -                       Runtime dependencies
<span class="linenr">5:  </span>testCompile     compile                 compileTestJava         Additional dependencies for compiling tests.
<span class="linenr">6:  </span>testRuntime     runtime, testCompile    test                    Additional dependencies for running tests only.
<span class="linenr">7:  </span>archives        -                       uploadArchives          Artifacts (e.g. jars) produced by this project.
<span class="linenr">8:  </span>default         runtime                 -                       The default configuration used by a project dependency on this project.
<span class="linenr">9:  </span>                                                                Contains the artifacts and dependencies required by this project at runtime.
</pre>

<p>
   对于加入工程的每个源集，Java插件增加如下依赖配置：
</p>


<pre class="example"><span class="linenr">1:  </span>Example: Java plugin - source set dependency configurations
<span class="linenr">2:  </span>Name                    Extends                 Used by tasks           Meaning
<span class="linenr">3:  </span>sourceSetCompile        -                       compileSourceSetJava    Compile time dependencies for the given source set
<span class="linenr">4:  </span>sourceSetRuntime        sourceSetCompile        -                       Runtime time dependencies for the given source set
</pre>

</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Convention properties传统属性</h3>
<div class="outline-text-3" id="text-2-7">

<p>  Java插件有一些传统属性，如下。你可以直接在脚本中使用这些属性，
</p>


<pre class="example"><span class="linenr"> 1:  </span>Table: Java plugin - directory properties
<span class="linenr"> 2:  </span>Property name       Type                Default value                Description
<span class="linenr"> 3:  </span>reportsDirName      String              reports                      The name of the directory to generate reports into, relative to the build directory.
<span class="linenr"> 4:  </span>reportsDir          File (read-only)    buildDir/reportsDirName      The directory to generate reports into.
<span class="linenr"> 5:  </span>testResultsDirName  String              test-results                 The name of the directory to generate test result .xml files into,
<span class="linenr"> 6:  </span>                                                                     relative to the build directory.
<span class="linenr"> 7:  </span>testResultsDir      File (read-only)    buildDir/testResultsDirName  The directory to generate test result .xml files into.
<span class="linenr"> 8:  </span>testReportDirName   String              tests                        The name of the directory to generate the test report into,
<span class="linenr"> 9:  </span>                                                                     relative to the reports directory.
<span class="linenr">10:  </span>testReportDir       File (read-only)    reportsDir/testReportDirName The directory to generate the test report into.
<span class="linenr">11:  </span>libsDirName         String              libs                         The name of the directory to generate libraries into, relative to the build directory.
<span class="linenr">12:  </span>libsDir             File (read-only)    buildDir/libsDirName         The directory to generate libraries into.
<span class="linenr">13:  </span>distsDirName        String              distributions                The name of the directory to generate distributions into,
<span class="linenr">14:  </span>                                                                     relative to the build directory.
<span class="linenr">15:  </span>distsDir            File (read-only)    buildDir/distsDirName        The directory to generate distributions into.
<span class="linenr">16:  </span>docsDirName         String              docs                         The name of the directory to generate documentation into,
<span class="linenr">17:  </span>                                                                     relative to the build directory.
<span class="linenr">18:  </span>docsDir             File (read-only)    buildDir/docsDirName         The directory to generate documentation into.
<span class="linenr">19:  </span>dependencyCacheDirName  String          dependency-cache             The name of the directory to use to cache source dependency information,
<span class="linenr">20:  </span>                                                                     relative to the build directory.
<span class="linenr">21:  </span>dependencyCacheDir  File (read-only)    buildDir/dependencyCacheDirName  The directory to use to cache source dependency information.
</pre>


</div>

</div>

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> Java plugin &ndash;other properties</h3>
<div class="outline-text-3" id="text-2-8">




<pre class="example"><span class="linenr">1:  </span>Property name           Type                            Default value                   Description
<span class="linenr">2:  </span>sourceSets              SourceSetContainer(read-only)   Not null                        Contains the project's source sets.
<span class="linenr">3:  </span>sourceCompatibility     JavaVersion.                    Value of the current used JVM   Java version compatibility to use when compiling Java source.
<span class="linenr">4:  </span>targetCompatibility     JavaVersion.                    sourceCompatibility             Java version to generate classes for.
<span class="linenr">5:  </span>archivesBaseName        String                          projectName                     The basename to use for archives, such as JAR or ZIP files.
<span class="linenr">6:  </span>manifest                Manifest                        an empty manifest               The manifest to include in all JAR files.
</pre>

<p>
这些属性来自传统对象：JavaPluginConvention, BasePluginConvention 和 ReportingBasePluginConvention.
</p></div>

</div>

<div id="outline-container-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> Working with source sets使用源集</h3>
<div class="outline-text-3" id="text-2-9">

<p>  通过sourceSets 属性访问源集，它是工程盛放源集的容器， SourceSetContainer类型的。 还有一个基本块 sourceSets { } ，可以使用闭包来配置源集容器。源集容器工作方式和其他容器完全一样，比如任务tasks.
</p>


<pre class="example"><span class="linenr"> 1:  </span>Example: Accessing a source set
<span class="linenr"> 2:  </span>build.gradle
<span class="linenr"> 3:  </span>// Various ways to access the main source set
<span class="linenr"> 4:  </span>println sourceSets.main.output.classesDir
<span class="linenr"> 5:  </span>println sourceSets['main'].output.classesDir
<span class="linenr"> 6:  </span>sourceSets {
<span class="linenr"> 7:  </span>    println main.output.classesDir
<span class="linenr"> 8:  </span>}
<span class="linenr"> 9:  </span>sourceSets {
<span class="linenr">10:  </span>    main {
<span class="linenr">11:  </span>        println output.classesDir
<span class="linenr">12:  </span>    }
<span class="linenr">13:  </span>}
<span class="linenr">14:  </span>
<span class="linenr">15:  </span>// Iterate over the source sets
<span class="linenr">16:  </span>sourceSets.all {
<span class="linenr">17:  </span>    println name
<span class="linenr">18:  </span>}
</pre>

<p>
要配置容器，只要用上面的任意一个方法设置源集属性值即可。源集的属性下面会描述。先简单看个例子：
</p>


<pre class="example"><span class="linenr"> 1:  </span>Example:  Configuring the source directories of a source set
<span class="linenr"> 2:  </span>build.gradle
<span class="linenr"> 3:  </span>sourceSets {
<span class="linenr"> 4:  </span>    main {
<span class="linenr"> 5:  </span>        java {
<span class="linenr"> 6:  </span>            srcDir 'src/java'
<span class="linenr"> 7:  </span>        }
<span class="linenr"> 8:  </span>        resources {
<span class="linenr"> 9:  </span>            srcDir 'src/resources'
<span class="linenr">10:  </span>        }
<span class="linenr">11:  </span>    }
<span class="linenr">12:  </span>}
</pre>

</div>

</div>
