java/src/latex_tutorial.org
** Source set properties源集属性
  下面是一些常用的重要的属性，更多的参见：SourceSet.
#+begin_src latex -n   
Table: Java plugin - source set properties
Property name		Type				Default value	                Description
name			String (read-only)		Not null	                The name of the source set, used to identify it.
output			SourceSetOutput (read-only)	Not null	                The output files of the source set,
							                                containing its compiled classes and resources.
output.classesDir	File				buildDir/classes/name	        The directory to generate the classes of this source set into.
output.resourcesDir	File				buildDir/resources/name         The directory to generate the resources of this source set into.
compileClasspath	FileCollection			compileSourceSet configuration.	The classpath to use when compiling the
							                                source files of this source set.
runtimeClasspath	FileCollection			output+runtimeSourceSetconfiguration.	The classpath to use when executing the classes of this source set.
java			SourceDirectorySet (read-only)	Not null	                 The Java source files of this source set. Contains only .java
							                                 files found in the Java source directories, and excludes all other files.
java.srcDirs		Set<File>. Can set using	[projectDir/src/name/java]	 The source directories containing the Java source files of this source set.
			anything described in
			Section 16.5, “Specifying a
			set of input files”.	  
resources		SourceDirectorySet (read-only)	Not null	                 The resources of this source set. Contains only resources, and excludes
							                                 any.java files found in the resource source directories. Other plugins,
											 such as the Groovy plugin, exclude additional types of files from this collection.
resources.srcDirs	Set<File>. Can set using	[projectDir/src/name/resources]  The source directories containing the resources of this source set.
			anything described in Section
			16.5, “Specifying a set of
			input files”.		
allJava			SourceDirectorySet(read-only)	java	                         All .java files of this source set. Some plugins, such as the Groovy plugin,
							                                 add additional Java source files to this collection.
allSource		SourceDirectorySet(read-only)	resources + java	         All source files of this source set. This include all resource files and all
							                                 Java source files. Some plugins, such as the Groovy plugin, add additional
											 source files to this collection.
#+end_src
** Defining new source sets新建源集
在 sourceSets { } 块中命名就可以创建源集了:
#+begin_src latex -n
Example  Defining a source set
build.gradle
sourceSets {
    intTest
}
#+end_src
新建源集后Java插件会给它增加一些依赖配置，见上文： Table: “Java plugin - source set dependency configurations”. 你可以用这些配置定义源集的编译和运行时依赖。
#+begin_src latex -n
Example  Defining source set dependencies
build.gradle
sourceSets {
    intTest
}

dependencies {
    intTestCompile 'junit:junit:4.11'
    intTestRuntime 'org.ow2.asm:asm-all:4.0'
}
#+end_src
Java插件会增加一些汇编任务给源集，见上文“Java plugin - source set tasks”. 比如对于 intTest的源集可以通过执行 gradle intTestClasses 来编译
#+begin_src latex -n
Example  Compiling a source set

Output of gradle intTestClasses
> gradle intTestClasses
:compileIntTestJava
:processIntTestResources
:intTestClasses

BUILD SUCCESSFUL

Total time: 1 secs
#+end_src
** javadoc
#+begin_src latex -n
javadoc任务是Javadoc的实例。它支持核心javadoc选项和标准doclet选项（见 reference documentation )。完整信息参考 CoreJavadocOptions and StandardJavadocDocletOptions.
Table: Java plugin - Javadoc properties
Task Property			    Type		           Default Value
classpath			    FileCollection	           sourceSets.main.output + sourceSets.main.compileClasspath
source				    FileTree. Can set using anything described in Section 16.5, “Specifying a set of input files”.	sourceSets.main.allJava
destinationDir			    File		           docsDir/javadoc
title				    String		           The name and version of the project
#+end_src
** clean
clean 任务是Delete的实例，它会把 dir 属性值对应的目录删掉.
#+begin_src latex -n
Table  Java plugin - Clean properties
Task Property			    Type		            Default Value
dir				    File		            buildDir
#+end_src
Resources资源
The Java plugin uses the Copy task for resource handling. It adds an instance for each source set in the project. You can find out more about the copy task in “Copying files”.
#+begin_src latex -n
Table: Java plugin - ProcessResources properties
Task Property    Type		                                                                        Default Value
srcDirs		 Object. Can set using anything described in Section “Specifying a set of input files”.	sourceSet.resources
destinationDir	 File. Can set using anything described in Section “Locating files”.	                sourceSet.output.resourcesDir
#+end_src
** CompileJava编译
Java插件会给工程中的每个源集增加一个 JavaCompile 类型实例。主要的配置选项如下：
#+begin_src latex -n
Table:. Java plugin - Compile properties
Task Property	 Type		                                                                 Default Value
classpath	 FileCollection	                                                                 sourceSet.compileClasspath
source		 FileTree.Can set using anything described in “Specifying a set of input files”. sourceSet.java
destinationDir	 File.		                                                                 sourceSet.output.classesDir
#+end_src
编译任务委托了Ant的 javac 任务，将options.useAnt设为false可以激活Grass的编译集成从而绕过Ant的任务。以后这会成为默认任务。
默认Java的编译工作在Gradle进程中执行。将options.fork 设为 true 会生成单独的进程。在Ant中这样做会减慢编译速度，而在Gradle中相反，Gradle会尽量重复使用编译进程。优先尊重的选项是options.forkOptions
