java/src/latex_tutorial.html

<div id="outline-container-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> Source set properties源集属性</h3>
<div class="outline-text-3" id="text-2-10">

<p>  下面是一些常用的重要的属性，更多的参见：SourceSet.
</p>


<pre class="example"><span class="linenr"> 1:  </span>Table: Java plugin - source set properties
<span class="linenr"> 2:  </span>Property name           Type                            Default value                   Description
<span class="linenr"> 3:  </span>name                    String (read-only)              Not null                        The name of the source set, used to identify it.
<span class="linenr"> 4:  </span>output                  SourceSetOutput (read-only)     Not null                        The output files of the source set,
<span class="linenr"> 5:  </span>                                                                                        containing its compiled classes and resources.
<span class="linenr"> 6:  </span>output.classesDir       File                            buildDir/classes/name           The directory to generate the classes of this source set into.
<span class="linenr"> 7:  </span>output.resourcesDir     File                            buildDir/resources/name         The directory to generate the resources of this source set into.
<span class="linenr"> 8:  </span>compileClasspath        FileCollection                  compileSourceSet configuration. The classpath to use when compiling the
<span class="linenr"> 9:  </span>                                                                                        source files of this source set.
<span class="linenr">10:  </span>runtimeClasspath        FileCollection                  output+runtimeSourceSetconfiguration.   The classpath to use when executing the classes of this source set.
<span class="linenr">11:  </span>java                    SourceDirectorySet (read-only)  Not null                         The Java source files of this source set. Contains only .java
<span class="linenr">12:  </span>                                                                                         files found in the Java source directories, and excludes all other files.
<span class="linenr">13:  </span>java.srcDirs            Set&lt;File&gt;. Can set using        [projectDir/src/name/java]       The source directories containing the Java source files of this source set.
<span class="linenr">14:  </span>                        anything described in
<span class="linenr">15:  </span>                        Section 16.5, “Specifying a
<span class="linenr">16:  </span>                        set of input files”.      
<span class="linenr">17:  </span>resources               SourceDirectorySet (read-only)  Not null                         The resources of this source set. Contains only resources, and excludes
<span class="linenr">18:  </span>                                                                                         any.java files found in the resource source directories. Other plugins,
<span class="linenr">19:  </span>                                                                                         such as the Groovy plugin, exclude additional types of files from this collection.
<span class="linenr">20:  </span>resources.srcDirs       Set&lt;File&gt;. Can set using        [projectDir/src/name/resources]  The source directories containing the resources of this source set.
<span class="linenr">21:  </span>                        anything described in Section
<span class="linenr">22:  </span>                        16.5, “Specifying a set of
<span class="linenr">23:  </span>                        input files”.           
<span class="linenr">24:  </span>allJava                 SourceDirectorySet(read-only)   java                             All .java files of this source set. Some plugins, such as the Groovy plugin,
<span class="linenr">25:  </span>                                                                                         add additional Java source files to this collection.
<span class="linenr">26:  </span>allSource               SourceDirectorySet(read-only)   resources + java                 All source files of this source set. This include all resource files and all
<span class="linenr">27:  </span>                                                                                         Java source files. Some plugins, such as the Groovy plugin, add additional
<span class="linenr">28:  </span>                                                                                         source files to this collection.
</pre>

</div>

</div>

<div id="outline-container-2-11" class="outline-3">
<h3 id="sec-2-11"><span class="section-number-3">2.11</span> Defining new source sets新建源集</h3>
<div class="outline-text-3" id="text-2-11">

<p>在 sourceSets { } 块中命名就可以创建源集了:
</p>


<pre class="example"><span class="linenr">1:  </span>Example  Defining a source set
<span class="linenr">2:  </span>build.gradle
<span class="linenr">3:  </span>sourceSets {
<span class="linenr">4:  </span>    intTest
<span class="linenr">5:  </span>}
</pre>

<p>
新建源集后Java插件会给它增加一些依赖配置，见上文： Table: “Java plugin - source set dependency configurations”. 你可以用这些配置定义源集的编译和运行时依赖。
</p>


<pre class="example"><span class="linenr"> 1:  </span>Example  Defining source set dependencies
<span class="linenr"> 2:  </span>build.gradle
<span class="linenr"> 3:  </span>sourceSets {
<span class="linenr"> 4:  </span>    intTest
<span class="linenr"> 5:  </span>}
<span class="linenr"> 6:  </span>
<span class="linenr"> 7:  </span>dependencies {
<span class="linenr"> 8:  </span>    intTestCompile 'junit:junit:4.11'
<span class="linenr"> 9:  </span>    intTestRuntime 'org.ow2.asm:asm-all:4.0'
<span class="linenr">10:  </span>}
</pre>

<p>
Java插件会增加一些汇编任务给源集，见上文“Java plugin - source set tasks”. 比如对于 intTest的源集可以通过执行 gradle intTestClasses 来编译
</p>


<pre class="example"><span class="linenr"> 1:  </span>Example  Compiling a source set
<span class="linenr"> 2:  </span>
<span class="linenr"> 3:  </span>Output of gradle intTestClasses
<span class="linenr"> 4:  </span>&gt; gradle intTestClasses
<span class="linenr"> 5:  </span>:compileIntTestJava
<span class="linenr"> 6:  </span>:processIntTestResources
<span class="linenr"> 7:  </span>:intTestClasses
<span class="linenr"> 8:  </span>
<span class="linenr"> 9:  </span>BUILD SUCCESSFUL
<span class="linenr">10:  </span>
<span class="linenr">11:  </span>Total time: 1 secs
</pre>

</div>

</div>

<div id="outline-container-2-12" class="outline-3">
<h3 id="sec-2-12"><span class="section-number-3">2.12</span> javadoc</h3>
<div class="outline-text-3" id="text-2-12">




<pre class="example"><span class="linenr">1:  </span>javadoc任务是Javadoc的实例。它支持核心javadoc选项和标准doclet选项（见 reference documentation )。完整信息参考 CoreJavadocOptions and StandardJavadocDocletOptions.
<span class="linenr">2:  </span>Table: Java plugin - Javadoc properties
<span class="linenr">3:  </span>Task Property                       Type                           Default Value
<span class="linenr">4:  </span>classpath                           FileCollection                 sourceSets.main.output + sourceSets.main.compileClasspath
<span class="linenr">5:  </span>source                              FileTree. Can set using anything described in Section 16.5, “Specifying a set of input files”.      sourceSets.main.allJava
<span class="linenr">6:  </span>destinationDir                      File                           docsDir/javadoc
<span class="linenr">7:  </span>title                               String                         The name and version of the project
</pre>

</div>

</div>

<div id="outline-container-2-13" class="outline-3">
<h3 id="sec-2-13"><span class="section-number-3">2.13</span> clean</h3>
<div class="outline-text-3" id="text-2-13">

<p>clean 任务是Delete的实例，它会把 dir 属性值对应的目录删掉.
</p>


<pre class="example"><span class="linenr">1:  </span>Table  Java plugin - Clean properties
<span class="linenr">2:  </span>Task Property                       Type                            Default Value
<span class="linenr">3:  </span>dir                                 File                            buildDir
</pre>

<p>
Resources资源
The Java plugin uses the Copy task for resource handling. It adds an instance for each source set in the project. You can find out more about the copy task in “Copying files”.
</p>


<pre class="example"><span class="linenr">1:  </span>Table: Java plugin - ProcessResources properties
<span class="linenr">2:  </span>Task Property    Type                                                                                   Default Value
<span class="linenr">3:  </span>srcDirs          Object. Can set using anything described in Section “Specifying a set of input files”. sourceSet.resources
<span class="linenr">4:  </span>destinationDir   File. Can set using anything described in Section “Locating files”.                    sourceSet.output.resourcesDir
</pre>

</div>

</div>

<div id="outline-container-2-14" class="outline-3">
<h3 id="sec-2-14"><span class="section-number-3">2.14</span> CompileJava编译</h3>
<div class="outline-text-3" id="text-2-14">

<p>Java插件会给工程中的每个源集增加一个 JavaCompile 类型实例。主要的配置选项如下：
</p>


<pre class="example"><span class="linenr">1:  </span>Table:. Java plugin - Compile properties
<span class="linenr">2:  </span>Task Property    Type                                                                            Default Value
<span class="linenr">3:  </span>classpath        FileCollection                                                                  sourceSet.compileClasspath
<span class="linenr">4:  </span>source           FileTree.Can set using anything described in “Specifying a set of input files”. sourceSet.java
<span class="linenr">5:  </span>destinationDir   File.                                                                           sourceSet.output.classesDir
</pre>

<p>
编译任务委托了Ant的 javac 任务，将options.useAnt设为false可以激活Grass的编译集成从而绕过Ant的任务。以后这会成为默认任务。
默认Java的编译工作在Gradle进程中执行。将options.fork 设为 true 会生成单独的进程。在Ant中这样做会减慢编译速度，而在Gradle中相反，Gradle会尽量重复使用编译进程。优先尊重的选项是options.forkOptions
</p></div>

</div>
