java/src/latex_tutorial.org
** Jar打包
jar任务会生成jar文件，包括了工程的类文件和资源文件。jar文件是 archives 依赖配置的产出，所以依赖工程可以直接引用。如果要把工程上传到库，jar文件会被声明为依赖描述符的一部分。
** Manifest主配置清单
每个jar或war对象都有一个 manifest 属性，值为 Manifest的单独实例。压缩后对应的MANIFEST.MF文件就写入压缩文件中了。
#+begin_src latex -n
Example: Customization of MANIFEST.MF
build.gradle
jar {
    manifest {
        attributes("Implementation-Title": "Gradle", "Implementation-Version": version)
    }
}
#+end_src
可以创建 Manifest 的独立实例，这样就可以在jar中共享主配信息了。
#+begin_src latex -n
Example: Creating a manifest object.
build.gradle
ext.sharedManifest = manifest {
    attributes("Implementation-Title": "Gradle", "Implementation-Version": version)
}
task fooJar(type: Jar) {
    manifest = project.manifest {
        from sharedManifest
    }
}
#+end_src
Manifest 对象可以随便合并，可以是文件路径也可以是主配引用等等。
#+begin_src latex -n
Example: Separate MANIFEST.MF for a particular archive
build.gradle
task barJar(type: Jar) {
    manifest {
        attributes key1: 'value1'
        from sharedManifest, 'src/config/basemanifest.txt'
        from('src/config/javabasemanifest.txt', 'src/config/libbasemanifest.txt') {
            eachEntry { details ->
                if (details.baseValue != details.mergeValue) {
                    details.value = baseValue
                }
                if (details.key == 'foo') {
                    details.exclude()
                }
            }
        }
    }
}
#+end_src
Manifest会按照from 语句中的顺序进行合并。如果合并中发现相同的值则保持原来的，可以通过增加eachEntry 动作自定义合并行为，在里面要访问 ManifestMergeDetails 的实例。合并并不是立即执行的，而是在生成jar文件或者调用 writeTo 和 effectiveManifest的时候。要把主配写入硬盘很简单：
#+begin_src latex -n
Example: Separate MANIFEST.MF for a particular archive
build.gradle
jar.manifest.writeTo("$buildDir/mymanifest.mf")
#+end_src
** Dependencies
   Dependencies{} 是一个configuration block。它会在所有的Task执行之前运行，其作用就是准备好要用的变量和数据结构。
: 1）dependencies用于声明一组依赖，这些依赖会被组合为configuration;
: 2）configuration代表了一组构件及其依赖。
dependencies的语法结构如下：
#+begin_src latex -n
dependencies {
    configurationName dependencyNotation1, dependencyNotation2, ...
}
#+end_src
testCompile 就是configuration, 'junit:junit:4.11'则是dependencyNotation
例如:compile files('./a.jar')

还可以直接依赖本地jar包，如：
dependencies {
    compile fileTree(dir: 'libs', include: '*.jar')
}这样就可以直接依赖/libs/目录下所有的jar文件了。

** source files Dir
#+begin_src latex -n   
 Redefine where Gradle should expect Java source files (*.java)
    sourceSets {
        main {
            manifest.srcFile 'build/mergeOut.xml'
            java.srcDirs = ['../../src']
            resources.srcDirs = ['../../src']
            aidl.srcDirs = ['../../src']
            renderscript.srcDirs = ['../../src']
            res.srcDirs = ['.res_temp']
            assets.srcDirs = ['../../assets']
	    jniLibs.srcDirs = ['../../libs','../hll_ser_3.2.2/libs']
        }

    }
// Redefine where .class files are written
sourceSets.main.output.classesDir = file("classes")
#+end_src

** 在task中使用shell脚本
#+begin_src latex -n      
task doMyShell(type: Exec) {
    executable 'sh'
    args '-c','bash test.sh $arg'
}
#+end_src


* android项目中使用Gradle
