java/src/latex_tutorial.html

<div id="outline-container-2-15" class="outline-3">
<h3 id="sec-2-15"><span class="section-number-3">2.15</span> Jar打包</h3>
<div class="outline-text-3" id="text-2-15">

<p>jar任务会生成jar文件，包括了工程的类文件和资源文件。jar文件是 archives 依赖配置的产出，所以依赖工程可以直接引用。如果要把工程上传到库，jar文件会被声明为依赖描述符的一部分。
</p></div>

</div>

<div id="outline-container-2-16" class="outline-3">
<h3 id="sec-2-16"><span class="section-number-3">2.16</span> Manifest主配置清单</h3>
<div class="outline-text-3" id="text-2-16">

<p>每个jar或war对象都有一个 manifest 属性，值为 Manifest的单独实例。压缩后对应的MANIFEST.MF文件就写入压缩文件中了。
</p>


<pre class="example"><span class="linenr">1:  </span>Example: Customization of MANIFEST.MF
<span class="linenr">2:  </span>build.gradle
<span class="linenr">3:  </span>jar {
<span class="linenr">4:  </span>    manifest {
<span class="linenr">5:  </span>        attributes("Implementation-Title": "Gradle", "Implementation-Version": version)
<span class="linenr">6:  </span>    }
<span class="linenr">7:  </span>}
</pre>

<p>
可以创建 Manifest 的独立实例，这样就可以在jar中共享主配信息了。
</p>


<pre class="example"><span class="linenr"> 1:  </span>Example: Creating a manifest object.
<span class="linenr"> 2:  </span>build.gradle
<span class="linenr"> 3:  </span>ext.sharedManifest = manifest {
<span class="linenr"> 4:  </span>    attributes("Implementation-Title": "Gradle", "Implementation-Version": version)
<span class="linenr"> 5:  </span>}
<span class="linenr"> 6:  </span>task fooJar(type: Jar) {
<span class="linenr"> 7:  </span>    manifest = project.manifest {
<span class="linenr"> 8:  </span>        from sharedManifest
<span class="linenr"> 9:  </span>    }
<span class="linenr">10:  </span>}
</pre>

<p>
Manifest 对象可以随便合并，可以是文件路径也可以是主配引用等等。
</p>


<pre class="example"><span class="linenr"> 1:  </span>Example: Separate MANIFEST.MF for a particular archive
<span class="linenr"> 2:  </span>build.gradle
<span class="linenr"> 3:  </span>task barJar(type: Jar) {
<span class="linenr"> 4:  </span>    manifest {
<span class="linenr"> 5:  </span>        attributes key1: 'value1'
<span class="linenr"> 6:  </span>        from sharedManifest, 'src/config/basemanifest.txt'
<span class="linenr"> 7:  </span>        from('src/config/javabasemanifest.txt', 'src/config/libbasemanifest.txt') {
<span class="linenr"> 8:  </span>            eachEntry { details -&gt;
<span class="linenr"> 9:  </span>                if (details.baseValue != details.mergeValue) {
<span class="linenr">10:  </span>                    details.value = baseValue
<span class="linenr">11:  </span>                }
<span class="linenr">12:  </span>                if (details.key == 'foo') {
<span class="linenr">13:  </span>                    details.exclude()
<span class="linenr">14:  </span>                }
<span class="linenr">15:  </span>            }
<span class="linenr">16:  </span>        }
<span class="linenr">17:  </span>    }
<span class="linenr">18:  </span>}
</pre>

<p>
Manifest会按照from 语句中的顺序进行合并。如果合并中发现相同的值则保持原来的，可以通过增加eachEntry 动作自定义合并行为，在里面要访问 ManifestMergeDetails 的实例。合并并不是立即执行的，而是在生成jar文件或者调用 writeTo 和 effectiveManifest的时候。要把主配写入硬盘很简单：
</p>


<pre class="example"><span class="linenr">1:  </span>Example: Separate MANIFEST.MF for a particular archive
<span class="linenr">2:  </span>build.gradle
<span class="linenr">3:  </span>jar.manifest.writeTo("$buildDir/mymanifest.mf")
</pre>

</div>

</div>

<div id="outline-container-2-17" class="outline-3">
<h3 id="sec-2-17"><span class="section-number-3">2.17</span> Dependencies</h3>
<div class="outline-text-3" id="text-2-17">

<p>   Dependencies{} 是一个configuration block。它会在所有的Task执行之前运行，其作用就是准备好要用的变量和数据结构。
</p><pre class="example">
1）dependencies用于声明一组依赖，这些依赖会被组合为configuration;
2）configuration代表了一组构件及其依赖。
</pre>

<p>dependencies的语法结构如下：
</p>


<pre class="example"><span class="linenr">1:  </span>dependencies {
<span class="linenr">2:  </span>    configurationName dependencyNotation1, dependencyNotation2, ...
<span class="linenr">3:  </span>}
</pre>

<p>
testCompile 就是configuration, 'junit:junit:4.11'则是dependencyNotation
例如:compile files('./a.jar')
</p>
<p>
还可以直接依赖本地jar包，如：
dependencies {
    compile fileTree(dir: 'libs', include: '*.jar')
}这样就可以直接依赖/libs/目录下所有的jar文件了。
</p>
</div>

</div>

<div id="outline-container-2-18" class="outline-3">
<h3 id="sec-2-18"><span class="section-number-3">2.18</span> source files Dir</h3>
<div class="outline-text-3" id="text-2-18">




<pre class="example"><span class="linenr"> 1:  </span> Redefine where Gradle should expect Java source files (*.java)
<span class="linenr"> 2:  </span>    sourceSets {
<span class="linenr"> 3:  </span>        main {
<span class="linenr"> 4:  </span>            manifest.srcFile 'build/mergeOut.xml'
<span class="linenr"> 5:  </span>            java.srcDirs = ['../../src']
<span class="linenr"> 6:  </span>            resources.srcDirs = ['../../src']
<span class="linenr"> 7:  </span>            aidl.srcDirs = ['../../src']
<span class="linenr"> 8:  </span>            renderscript.srcDirs = ['../../src']
<span class="linenr"> 9:  </span>            res.srcDirs = ['.res_temp']
<span class="linenr">10:  </span>            assets.srcDirs = ['../../assets']
<span class="linenr">11:  </span>            jniLibs.srcDirs = ['../../libs','../hll_ser_3.2.2/libs']
<span class="linenr">12:  </span>        }
<span class="linenr">13:  </span>
<span class="linenr">14:  </span>    }
<span class="linenr">15:  </span>// Redefine where .class files are written
<span class="linenr">16:  </span>sourceSets.main.output.classesDir = file("classes")
</pre>


</div>

</div>

<div id="outline-container-2-19" class="outline-3">
<h3 id="sec-2-19"><span class="section-number-3">2.19</span> 在task中使用shell脚本</h3>
<div class="outline-text-3" id="text-2-19">




<pre class="example"><span class="linenr">1:  </span>task doMyShell(type: Exec) {
<span class="linenr">2:  </span>    executable 'sh'
<span class="linenr">3:  </span>    args '-c','bash test.sh $arg'
<span class="linenr">4:  </span>}
</pre>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> android项目中使用Gradle</h2>
<div class="outline-text-2" id="text-3">


</div>
