java/src/latex_tutorial.org
** 构建一个Gradle android项目
首先，你要安装Gradle 1.6 并且，写进系统的环境变量里面，所有的命令都是默认你已经配好了gradle 的环境。而且已经升级了android sdk
1.要用gradle构建android有三种方式：（build.gradle 放到项目目录下）
: 1).利用adt 22导出 build.gradle.
: 2).复制别人写好的build.gradle 文件.
: 3).根据gradle 规则，手写android 的build.gradle 文件。
推荐1,2 方法.
2.第一次使用gradle 构建android项目建议你先使用gradle clean 把android gradle 插件，还有相关依赖包下载下来并且对环境进行初始化，如果出错了，一般可能是下载超时，试多几次即可，最后你会看到如下提示：BUILD SUCCESSFUL
#+begin_src latex -n
chiplua@chiplua:~/workspace/java/src_android$ ls
build.gradle
chiplua@chiplua:~/workspace/java/src_android$ gradle clean
:clean UP-TO-DATE

BUILD SUCCESSFUL

Total time: 4.827 secs
chiplua@chiplua:~/workspace/java/src_android$ la
build.gradle  .gradle
chiplua@chiplua:~/workspace/java/src_android$ 
#+end_src
3.编译
使用命令gradle build
使用gradle build 就完成了android 项目的构建了。你将会在项目目录里面看到一个build 的目录,最终打包的apk 就在build/apk 目录下了。然后，你会发现，两个apk 一个是 [项目名]-debug-unaligned [项目名]-release-unsigned。


#+begin_src latex -n        
  buildscript {//Configures the build script classpath for this project. 说白了就是设置脚本的运行环境

    repositories {//Returns a handler to create repositories which are used for retrieving dependencies and uploading artifacts produced by the project. 大意就是支持java依赖库管理（maven/ivy）,用于项目的依赖。这也是gradle 强力的地方。
        mavenCentral()
    }

    dependencies {//The dependency handler of this project. The returned dependency handler instance can be used for adding new dependencies. For accessing already declared dependencies, the configurations can be used. 依赖包的定义。支持maven/ivy，远程，本地库，也支持单文件，如果前面定义了repositories{}maven 库，使用maven的依赖的时候只需要按照用类似于com.android.tools.build:gradle:0.4，gradle 就会自动的往远程库下载相应的依赖
        classpath 'com.android.tools.build:gradle:0.8+'
    }
}

apply plugin: 'android'   //声明构建的项目类型，这里当然是android。

dependencies {
}

android {

    compileSdkVersion 19
    buildToolsVersion "19"

    defaultConfig {
        minSdkVersion 15
        targetSdkVersion 19
    }
    
    //声明创建一个带签名的发布版本细节
    signingConfigs {
        release {
            storeFile file("../hllkey.keystore")
            storePassword "szty1234"
            keyAlias "haolianluo"
            keyPassword "szty1234"           
        }
    }
    
    buildTypes {
        release {
            runProguard true
            proguardFiles '../../proguard-project.txt'
            signingConfig signingConfigs.release
        }
    }
    
    sourceSets {
        main {
            manifest.srcFile 'build/mergeOut.xml'
            java.srcDirs = ['../../src']
            resources.srcDirs = ['../../src']
            aidl.srcDirs = ['../../src']
            renderscript.srcDirs = ['../../src']
            res.srcDirs = ['.res_temp']
            assets.srcDirs = ['../../assets']
	    jniLibs.srcDirs = ['../../libs','../hll_ser_3.2.2/libs']
        }

    }
    
    
    dependencies {
        compile 'com.android.support:support-v4:+'
        compile files('../hll_ser_3.2.2/libs/hll_jar_v3.2.2.jar')
        compile files('../../libs/Msc.jar')
        compile files('../../libs/SpeechApi.jar')
	compile files('../../libs/jcc-bate-0.7.3.jar')
    }
	
 lintOptions {
          abortOnError false
      }
    
    
}
#+end_src
 
** Gralde 打包参数详解
*** 打签名包
默认输出release apk是没有签名的，那么我们需要签名的很简单，只需要在android{}里面补充加上即可。
#+begin_src latex -n
build.gradle
signingConfigs {
   myConfig{
     storeFile file("gradle.keystore")
    	storePassword "gradle"
    	keyAlias "gradle"
    	keyPassword "gradle"
    }
}
    
   buildTypes{
     release {
    	signingConfig  signingConfigs.myConfig
     } 
   }
#+end_src latex -n 
然后，运行gradle clean  gradle build ,这次在build/apk 你看到了多了一个[项目名]-release-unaligned， 从字面上面我就可以知道，这个只是没有进行zipAlign 优化的版本而已。而[项目名]-release 就是我们签名，并且zipAlign的apk包了. ###打混淆包### 只需要在原来的基础上加上
#+begin_src latex -n
build.gradle
buildTypes{
   release {
   signingConfig  signingConfigs.myConfig
     runProguard true
     proguardFile 'proguard-android.txt'
   }
}
#+end_src 
gradle clean
gradle build   
 
