java/src/latex_tutorial.html

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 构建一个Gradle android项目</h3>
<div class="outline-text-3" id="text-3-1">

<p>首先，你要安装Gradle 1.6 并且，写进系统的环境变量里面，所有的命令都是默认你已经配好了gradle 的环境。而且已经升级了android sdk
1.要用gradle构建android有三种方式：（build.gradle 放到项目目录下）
</p><pre class="example">
1).利用adt 22导出 build.gradle.
2).复制别人写好的build.gradle 文件.
3).根据gradle 规则，手写android 的build.gradle 文件。
</pre>

<p>推荐1,2 方法.
2.第一次使用gradle 构建android项目建议你先使用gradle clean 把android gradle 插件，还有相关依赖包下载下来并且对环境进行初始化，如果出错了，一般可能是下载超时，试多几次即可，最后你会看到如下提示：BUILD SUCCESSFUL
</p>


<pre class="example"><span class="linenr"> 1:  </span>chiplua@chiplua:~/workspace/java/src_android$ ls
<span class="linenr"> 2:  </span>build.gradle
<span class="linenr"> 3:  </span>chiplua@chiplua:~/workspace/java/src_android$ gradle clean
<span class="linenr"> 4:  </span>:clean UP-TO-DATE
<span class="linenr"> 5:  </span>
<span class="linenr"> 6:  </span>BUILD SUCCESSFUL
<span class="linenr"> 7:  </span>
<span class="linenr"> 8:  </span>Total time: 4.827 secs
<span class="linenr"> 9:  </span>chiplua@chiplua:~/workspace/java/src_android$ la
<span class="linenr">10:  </span>build.gradle  .gradle
<span class="linenr">11:  </span>chiplua@chiplua:~/workspace/java/src_android$ 
</pre>

<p>
3.编译
使用命令gradle build
使用gradle build 就完成了android 项目的构建了。你将会在项目目录里面看到一个build 的目录,最终打包的apk 就在build/apk 目录下了。然后，你会发现，两个apk 一个是 [项目名]-debug-unaligned [项目名]-release-unsigned。
</p>




<pre class="example"><span class="linenr"> 1:  </span>  buildscript {//Configures the build script classpath for this project. 说白了就是设置脚本的运行环境
<span class="linenr"> 2:  </span>
<span class="linenr"> 3:  </span>    repositories {//Returns a handler to create repositories which are used for retrieving dependencies and uploading artifacts produced by the project. 大意就是支持java依赖库管理（maven/ivy）,用于项目的依赖。这也是gradle 强力的地方。
<span class="linenr"> 4:  </span>        mavenCentral()
<span class="linenr"> 5:  </span>    }
<span class="linenr"> 6:  </span>
<span class="linenr"> 7:  </span>    dependencies {//The dependency handler of this project. The returned dependency handler instance can be used for adding new dependencies. For accessing already declared dependencies, the configurations can be used. 依赖包的定义。支持maven/ivy，远程，本地库，也支持单文件，如果前面定义了repositories{}maven 库，使用maven的依赖的时候只需要按照用类似于com.android.tools.build:gradle:0.4，gradle 就会自动的往远程库下载相应的依赖
<span class="linenr"> 8:  </span>        classpath 'com.android.tools.build:gradle:0.8+'
<span class="linenr"> 9:  </span>    }
<span class="linenr">10:  </span>}
<span class="linenr">11:  </span>
<span class="linenr">12:  </span>apply plugin: 'android'   //声明构建的项目类型，这里当然是android。
<span class="linenr">13:  </span>
<span class="linenr">14:  </span>dependencies {
<span class="linenr">15:  </span>}
<span class="linenr">16:  </span>
<span class="linenr">17:  </span>android {
<span class="linenr">18:  </span>
<span class="linenr">19:  </span>    compileSdkVersion 19
<span class="linenr">20:  </span>    buildToolsVersion "19"
<span class="linenr">21:  </span>
<span class="linenr">22:  </span>    defaultConfig {
<span class="linenr">23:  </span>        minSdkVersion 15
<span class="linenr">24:  </span>        targetSdkVersion 19
<span class="linenr">25:  </span>    }
<span class="linenr">26:  </span>
<span class="linenr">27:  </span>    //声明创建一个带签名的发布版本细节
<span class="linenr">28:  </span>    signingConfigs {
<span class="linenr">29:  </span>        release {
<span class="linenr">30:  </span>            storeFile file("../hllkey.keystore")
<span class="linenr">31:  </span>            storePassword "szty1234"
<span class="linenr">32:  </span>            keyAlias "haolianluo"
<span class="linenr">33:  </span>            keyPassword "szty1234"           
<span class="linenr">34:  </span>        }
<span class="linenr">35:  </span>    }
<span class="linenr">36:  </span>
<span class="linenr">37:  </span>    buildTypes {
<span class="linenr">38:  </span>        release {
<span class="linenr">39:  </span>            runProguard true
<span class="linenr">40:  </span>            proguardFiles '../../proguard-project.txt'
<span class="linenr">41:  </span>            signingConfig signingConfigs.release
<span class="linenr">42:  </span>        }
<span class="linenr">43:  </span>    }
<span class="linenr">44:  </span>
<span class="linenr">45:  </span>    sourceSets {
<span class="linenr">46:  </span>        main {
<span class="linenr">47:  </span>            manifest.srcFile 'build/mergeOut.xml'
<span class="linenr">48:  </span>            java.srcDirs = ['../../src']
<span class="linenr">49:  </span>            resources.srcDirs = ['../../src']
<span class="linenr">50:  </span>            aidl.srcDirs = ['../../src']
<span class="linenr">51:  </span>            renderscript.srcDirs = ['../../src']
<span class="linenr">52:  </span>            res.srcDirs = ['.res_temp']
<span class="linenr">53:  </span>            assets.srcDirs = ['../../assets']
<span class="linenr">54:  </span>            jniLibs.srcDirs = ['../../libs','../hll_ser_3.2.2/libs']
<span class="linenr">55:  </span>        }
<span class="linenr">56:  </span>
<span class="linenr">57:  </span>    }
<span class="linenr">58:  </span>
<span class="linenr">59:  </span>
<span class="linenr">60:  </span>    dependencies {
<span class="linenr">61:  </span>        compile 'com.android.support:support-v4:+'
<span class="linenr">62:  </span>        compile files('../hll_ser_3.2.2/libs/hll_jar_v3.2.2.jar')
<span class="linenr">63:  </span>        compile files('../../libs/Msc.jar')
<span class="linenr">64:  </span>        compile files('../../libs/SpeechApi.jar')
<span class="linenr">65:  </span>        compile files('../../libs/jcc-bate-0.7.3.jar')
<span class="linenr">66:  </span>    }
<span class="linenr">67:  </span>
<span class="linenr">68:  </span> lintOptions {
<span class="linenr">69:  </span>          abortOnError false
<span class="linenr">70:  </span>      }
<span class="linenr">71:  </span>
<span class="linenr">72:  </span>
<span class="linenr">73:  </span>}
</pre>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Gralde 打包参数详解</h3>
<div class="outline-text-3" id="text-3-2">


</div>

<div id="outline-container-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> 打签名包</h4>
<div class="outline-text-4" id="text-3-2-1">

<p>默认输出release apk是没有签名的，那么我们需要签名的很简单，只需要在android{}里面补充加上即可。
</p>


<pre class="example"><span class="linenr"> 1:  </span>build.gradle
<span class="linenr"> 2:  </span>signingConfigs {
<span class="linenr"> 3:  </span>   myConfig{
<span class="linenr"> 4:  </span>     storeFile file("gradle.keystore")
<span class="linenr"> 5:  </span>        storePassword "gradle"
<span class="linenr"> 6:  </span>        keyAlias "gradle"
<span class="linenr"> 7:  </span>        keyPassword "gradle"
<span class="linenr"> 8:  </span>    }
<span class="linenr"> 9:  </span>}
<span class="linenr">10:  </span>
<span class="linenr">11:  </span>   buildTypes{
<span class="linenr">12:  </span>     release {
<span class="linenr">13:  </span>        signingConfig  signingConfigs.myConfig
<span class="linenr">14:  </span>     } 
<span class="linenr">15:  </span>   }
</pre>

<p>
然后，运行gradle clean  gradle build ,这次在build/apk 你看到了多了一个[项目名]-release-unaligned， 从字面上面我就可以知道，这个只是没有进行zipAlign 优化的版本而已。而[项目名]-release 就是我们签名，并且zipAlign的apk包了. ###打混淆包### 只需要在原来的基础上加上
</p>


<pre class="example"><span class="linenr">1:  </span>build.gradle
<span class="linenr">2:  </span>buildTypes{
<span class="linenr">3:  </span>   release {
<span class="linenr">4:  </span>   signingConfig  signingConfigs.myConfig
<span class="linenr">5:  </span>     runProguard true
<span class="linenr">6:  </span>     proguardFile 'proguard-android.txt'
<span class="linenr">7:  </span>   }
<span class="linenr">8:  </span>}
</pre>

<p>
gradle clean
gradle build   
</p>
</div>
</div>

</div>
