java/src/latex_tutorial.org
** 打多渠道包(Product Flavor)
为什么产生了两个apk？
默认的android gralde 插件定义了两种apk的类型debug, release.这个是android gralde插件buildTypes{}方法产生的，默认配置好了两个默认模板,当然你也可以修改.前面我们就是在修改默认的release的配置,让输出release类型的的apk,具有签名和混淆。对于多渠道包,android 插件提供了一个名为Product Flavor{}的配置,用于进行多渠道打包。例如,我的android应用有海外版和国内版本.而且这两个版本的包名是不一样的。（按照这个思路，你要打包100个不同的市场只是几行代码的事情。
你只需要在android{} 补充上
#+begin_src latex -n
build.gradle
productFlavors {
	playstore {
			packageName='com.abcdef.androidgradle.playstore'
	}
	hiapk {
			packageName='com.adbcdef.androidgradle.amazonappstore'
	}
}
#+end_src
然后gradle clean,gradle build,在build/apk 下面你会看到一堆的包，命名格式[项目名]-[渠道名]-release

Product Flavor{} 
不只是能改包名那么简单,还能够对编译的源码目录进行切换。如果你用的是分发渠道分析,你需要修改AndroidManifest.xml添加上<meta-data android:value="hiapk" android:name="UMENG_CHANNEL"/>
如果你很多渠道,然后你就会很痛苦,现在用gradle就非常舒服,你只需要在android.sourceSets指定我们的渠道名就行,android gradle 插件，会自动打包,例如
#+begin_src latex -n
build.gradle
sourceSets {
    main {
        manifest.srcFile 'AndroidManifest.xml'
        java.srcDirs = ['src']
        resources.srcDirs = ['src']
        aidl.srcDirs = ['src']
        renderscript.srcDirs = ['src']
        res.srcDirs = ['res']
        assets.srcDirs = ['assets']
    }
        
    hiapk {
      	manifest.srcFile 'hiapk/AndroidManifest.xml'
    }    	
    playstore {
       		manifest.srcFile 'hiapk/AndroidManifest.xml'
    }
       
	instrumentTest.setRoot('tests')
        
}
#+end_src
然后运行gradle clean,gradle build,
