java/src/latex_tutorial.html

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 打多渠道包(Product Flavor)</h3>
<div class="outline-text-3" id="text-3-3">

<p>为什么产生了两个apk？
默认的android gralde 插件定义了两种apk的类型debug, release.这个是android gralde插件buildTypes{}方法产生的，默认配置好了两个默认模板,当然你也可以修改.前面我们就是在修改默认的release的配置,让输出release类型的的apk,具有签名和混淆。对于多渠道包,android 插件提供了一个名为Product Flavor{}的配置,用于进行多渠道打包。例如,我的android应用有海外版和国内版本.而且这两个版本的包名是不一样的。（按照这个思路，你要打包100个不同的市场只是几行代码的事情。
你只需要在android{} 补充上
</p>


<pre class="example"><span class="linenr">1:  </span>build.gradle
<span class="linenr">2:  </span>productFlavors {
<span class="linenr">3:  </span>        playstore {
<span class="linenr">4:  </span>                        packageName='com.abcdef.androidgradle.playstore'
<span class="linenr">5:  </span>        }
<span class="linenr">6:  </span>        hiapk {
<span class="linenr">7:  </span>                        packageName='com.adbcdef.androidgradle.amazonappstore'
<span class="linenr">8:  </span>        }
<span class="linenr">9:  </span>}
</pre>

<p>
然后gradle clean,gradle build,在build/apk 下面你会看到一堆的包，命名格式[项目名]-[渠道名]-release
</p>
<p>
Product Flavor{} 
不只是能改包名那么简单,还能够对编译的源码目录进行切换。如果你用的是分发渠道分析,你需要修改AndroidManifest.xml添加上&lt;meta-data android:value="hiapk" android:name="UMENG_CHANNEL"/&gt;
如果你很多渠道,然后你就会很痛苦,现在用gradle就非常舒服,你只需要在android.sourceSets指定我们的渠道名就行,android gradle 插件，会自动打包,例如
</p>


<pre class="example"><span class="linenr"> 1:  </span>build.gradle
<span class="linenr"> 2:  </span>sourceSets {
<span class="linenr"> 3:  </span>    main {
<span class="linenr"> 4:  </span>        manifest.srcFile 'AndroidManifest.xml'
<span class="linenr"> 5:  </span>        java.srcDirs = ['src']
<span class="linenr"> 6:  </span>        resources.srcDirs = ['src']
<span class="linenr"> 7:  </span>        aidl.srcDirs = ['src']
<span class="linenr"> 8:  </span>        renderscript.srcDirs = ['src']
<span class="linenr"> 9:  </span>        res.srcDirs = ['res']
<span class="linenr">10:  </span>        assets.srcDirs = ['assets']
<span class="linenr">11:  </span>    }
<span class="linenr">12:  </span>
<span class="linenr">13:  </span>    hiapk {
<span class="linenr">14:  </span>        manifest.srcFile 'hiapk/AndroidManifest.xml'
<span class="linenr">15:  </span>    }           
<span class="linenr">16:  </span>    playstore {
<span class="linenr">17:  </span>                manifest.srcFile 'hiapk/AndroidManifest.xml'
<span class="linenr">18:  </span>    }
<span class="linenr">19:  </span>
<span class="linenr">20:  </span>        instrumentTest.setRoot('tests')
<span class="linenr">21:  </span>
<span class="linenr">22:  </span>}
</pre>

<p>
然后运行gradle clean,gradle build,
</p></div>
</div>
</div>
</div>

<div id="postamble">


</div>
</body>
</html>
